package com.example.quranfirstapp;

import androidx.appcompat.app.AppCompatActivity;

import android.os.Bundle;
import android.view.View;
import android.widget.Button;
import android.widget.EditText;
import android.widget.TextView;

public class MainActivity extends AppCompatActivity {
    TextView Ayat;
    EditText ParahNum;
    Button search;
    String [] quranText={
            "بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ",
            "اَلۡحَمۡدُ لِلّٰہِ رَبِّ الۡعٰلَمِیۡنَ ۙ﴿۱﴾",
            "الرَّحۡمٰنِ الرَّحِیۡمِ ۙ﴿۲﴾",
            "مٰلِکِ یَوۡمِ الدِّیۡنِ ؕ﴿۳﴾",
            "اِیَّاکَ نَعۡبُدُ وَ اِیَّاکَ نَسۡتَعِیۡنُ ؕ﴿۴﴾",
            "اِہۡدِ نَا الصِّرَاطَ الۡمُسۡتَقِیۡمَ ۙ﴿۵﴾",
            "صِرَاطَ الَّذِیۡنَ اَنۡعَمۡتَ عَلَیۡہِمۡ ۙ۬ غَیۡرِ الۡمَغۡضُوۡبِ عَلَیۡہِمۡ وَ لَا الضَّآلِّیۡنَ ٪﴿۷﴾",
            "بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ",
            "الٓـمّٓ ۚ﴿۱﴾",
            "ذٰلِکَ  الۡکِتٰبُ لَا رَیۡبَ ۚۖۛ فِیۡہِ ۚۛ ہُدًی  لِّلۡمُتَّقِیۡنَ ۙ﴿۲﴾",
            "الَّذِیۡنَ یُؤۡمِنُوۡنَ بِالۡغَیۡبِ وَ یُقِیۡمُوۡنَ الصَّلٰوۃَ وَ  مِمَّا رَزَقۡنٰہُمۡ  یُنۡفِقُوۡنَ ۙ﴿۳﴾",
            "وَ الَّذِیۡنَ یُؤۡمِنُوۡنَ بِمَاۤ  اُنۡزِلَ اِلَیۡکَ وَ مَاۤ اُنۡزِلَ مِنۡ قَبۡلِکَ ۚ وَ بِالۡاٰخِرَۃِ ہُمۡ یُوۡقِنُوۡنَ ؕ﴿۴﴾",
            "اُولٰٓئِکَ عَلٰی ہُدًی مِّنۡ رَّبِّہِمۡ ٭ وَ اُولٰٓئِکَ ہُمُ  الۡمُفۡلِحُوۡنَ ﴿۵﴾",
            "اِنَّ الَّذِیۡنَ  کَفَرُوۡا سَوَآءٌ  عَلَیۡہِمۡ ءَاَنۡذَرۡتَہُمۡ  اَمۡ  لَمۡ  تُنۡذِرۡہُمۡ لَا یُؤۡمِنُوۡنَ ﴿۶﴾",
            "خَتَمَ اللّٰہُ عَلٰی قُلُوۡبِہِمۡ وَ عَلٰی سَمۡعِہِمۡ ؕ  وَ عَلٰۤی اَبۡصَارِہِمۡ غِشَاوَۃٌ ۫ وَّ لَہُمۡ عَذَابٌ عَظِیۡمٌ ٪﴿۷﴾",
            "وَ مِنَ النَّاسِ مَنۡ یَّقُوۡلُ اٰمَنَّا بِاللّٰہِ وَ بِالۡیَوۡمِ الۡاٰخِرِ وَ مَا ہُمۡ بِمُؤۡمِنِیۡنَ ۘ﴿۸﴾",
            "یُخٰدِعُوۡنَ اللّٰہَ وَ الَّذِیۡنَ اٰمَنُوۡا ۚ وَ مَا یَخۡدَعُوۡنَ  اِلَّاۤ  اَنۡفُسَہُمۡ وَ مَا یَشۡعُرُوۡنَ ؕ﴿۹﴾",
            "فِیۡ قُلُوۡبِہِمۡ مَّرَضٌ ۙ فَزَادَہُمُ  اللّٰہُ  مَرَضًا ۚ  وَ لَہُمۡ عَذَابٌ اَلِیۡمٌۢ  ۬ۙ بِمَا کَانُوۡا یَکۡذِبُوۡنَ ﴿۱۰﴾",
            "وَ اِذَا قِیۡلَ لَہُمۡ لَا تُفۡسِدُوۡا فِی الۡاَرۡضِ ۙ  قَالُوۡۤا اِنَّمَا نَحۡنُ مُصۡلِحُوۡنَ ﴿۱۱﴾",
            "اَلَاۤ اِنَّہُمۡ ہُمُ الۡمُفۡسِدُوۡنَ وَ لٰکِنۡ لَّا یَشۡعُرُوۡنَ ﴿۱۲﴾",
            "وَ  اِذَا قِیۡلَ لَہُمۡ اٰمِنُوۡا کَمَاۤ اٰمَنَ النَّاسُ قَالُوۡۤا اَنُؤۡمِنُ کَمَاۤ اٰمَنَ السُّفَہَآءُ ؕ اَلَاۤ اِنَّہُمۡ ہُمُ  السُّفَہَآءُ  وَ لٰکِنۡ لَّا  یَعۡلَمُوۡنَ ﴿۱۳﴾",
            "وَ  اِذَا لَقُوا الَّذِیۡنَ اٰمَنُوۡا قَالُوۡۤا اٰمَنَّا ۚۖ وَ  اِذَا خَلَوۡا اِلٰی شَیٰطِیۡنِہِمۡ ۙ قَالُوۡۤا اِنَّا مَعَکُمۡ ۙ اِنَّمَا نَحۡنُ مُسۡتَہۡزِءُوۡنَ ﴿۱۴﴾",
            "اَللّٰہُ یَسۡتَہۡزِئُ بِہِمۡ وَ یَمُدُّہُمۡ  فِیۡ طُغۡیَانِہِمۡ یَعۡمَہُوۡنَ ﴿۱۵﴾",
            "اُولٰٓئِکَ الَّذِیۡنَ اشۡتَرَوُا الضَّلٰلَۃَ بِالۡہُدٰی ۪  فَمَا رَبِحَتۡ تِّجَارَتُہُمۡ وَ مَا کَانُوۡا مُہۡتَدِیۡنَ ﴿۱۶﴾",
            "مَثَلُہُمۡ کَمَثَلِ الَّذِی اسۡتَوۡقَدَ نَارًا ۚ  فَلَمَّاۤ اَضَآءَتۡ مَا حَوۡلَہٗ ذَہَبَ اللّٰہُ بِنُوۡرِہِمۡ وَ تَرَکَہُمۡ فِیۡ ظُلُمٰتٍ لَّا یُبۡصِرُوۡنَ ﴿۱۷﴾",
            "صُمٌّۢ  بُکۡمٌ عُمۡیٌ فَہُمۡ لَا یَرۡجِعُوۡنَ ﴿ۙ۱۸﴾",
            "اَوۡ کَصَیِّبٍ مِّنَ السَّمَآءِ فِیۡہِ ظُلُمٰتٌ وَّ رَعۡدٌ وَّ بَرۡقٌ ۚ یَجۡعَلُوۡنَ اَصَابِعَہُمۡ فِیۡۤ  اٰذَانِہِمۡ مِّنَ الصَّوَاعِقِ حَذَرَ الۡمَوۡتِ ؕ وَ اللّٰہُ مُحِیۡطٌۢ بِالۡکٰفِرِیۡنَ ﴿۱۹﴾",
            "یَکَادُ الۡبَرۡقُ یَخۡطَفُ اَبۡصَارَہُمۡ ؕ کُلَّمَاۤ اَضَآءَ لَہُمۡ مَّشَوۡا فِیۡہِ ٭ۙ وَ اِذَاۤ اَظۡلَمَ عَلَیۡہِمۡ قَامُوۡا ؕ وَ لَوۡ شَآءَ اللّٰہُ  لَذَہَبَ بِسَمۡعِہِمۡ وَ اَبۡصَارِہِمۡ ؕ اِنَّ اللّٰہَ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ ﴿٪۲۰﴾",
            "یٰۤاَیُّہَا النَّاسُ اعۡبُدُوۡا رَبَّکُمُ الَّذِیۡ خَلَقَکُمۡ وَ الَّذِیۡنَ مِنۡ قَبۡلِکُمۡ لَعَلَّکُمۡ تَتَّقُوۡنَ ﴿ۙ۲۱﴾",
            "الَّذِیۡ جَعَلَ لَکُمُ الۡاَرۡضَ فِرَاشًا وَّ السَّمَآءَ بِنَآءً ۪ وَّ اَنۡزَلَ مِنَ السَّمَآءِ مَآءً  فَاَخۡرَجَ بِہٖ مِنَ الثَّمَرٰتِ رِزۡقًا لَّکُمۡ ۚ فَلَا تَجۡعَلُوۡا لِلّٰہِ اَنۡدَادًا وَّ اَنۡتُمۡ تَعۡلَمُوۡنَ ﴿۲۲﴾",
            "وَ اِنۡ کُنۡتُمۡ فِیۡ رَیۡبٍ مِّمَّا نَزَّلۡنَا عَلٰی عَبۡدِنَا فَاۡتُوۡا بِسُوۡرَۃٍ مِّنۡ مِّثۡلِہٖ ۪ وَ ادۡعُوۡا شُہَدَآءَکُمۡ مِّنۡ دُوۡنِ اللّٰہِ  اِنۡ کُنۡتُمۡ صٰدِقِیۡنَ ﴿۲۳﴾",
    };
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);
        Ayat=findViewById(R.id.ayatText);
        ParahNum=findViewById(R.id.parahTextfield);
        search=findViewById(R.id.SearchBtn);
        search.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                String text=ParahNum.getText().toString();
                //Ayat.setText(text);
                int num=Integer.valueOf(text);

                //Ayat.setText(quranText[num]);
            }

        });
    }
}